contiki-ng/contiki-ng/arch/cpu/m2354/StdDriver/src/sdh.c
    while(sdh->CTL & SDH_CTL_R2EN_Msk)
    {
        if(pSD->IsCardInsert == (uint8_t)FALSE)
        {
            return SDH_NO_SD_CARD;
        }
        if(--u32TimeOutCount == 0)
        {
            g_SDH_i32ErrCode = SDH_TIMEOUT_ERR;
            break;
        }
    }

    if(sdh->INTSTS & SDH_INTSTS_CRC7_Msk)
    {
        for(i = 0UL; i < 5UL; i++)
        {
            au32TmpBuf[i] = SDH_Swap32(sdh->FB[i]);
        }
        for(i = 0UL; i < 4UL; i++)
        {
            pu32R2ptr[i] = ((au32TmpBuf[i] & 0x00ffffffUL) << 8) | ((au32TmpBuf[i + 1UL] & 0xff000000UL) >> 24);
        }
        return Successful;
    }
    else
    {
        return SDH_CRC7_ERROR;
    }
}


uint32_t SDH_SDCmdAndRspDataIn(SDH_T *sdh, uint32_t u32Cmd, uint32_t u32Arg)
{
    SDH_INFO_T *pSD;
    uint32_t u32TimeOutCount;

    g_SDH_i32ErrCode = 0;

    /* M2354 is only support SDH0 */
    pSD = &SD0;

    sdh->CMDARG = u32Arg;
    sdh->CTL = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | ((uint32_t)u32Cmd << 8) |
               (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);

    u32TimeOutCount = TIMEOUT_SDH;
    while(sdh->CTL & SDH_CTL_RIEN_Msk)
    {
        if(pSD->IsCardInsert == (uint32_t)FALSE)
        {
            return SDH_NO_SD_CARD;
        }
        if(--u32TimeOutCount == 0)
        {
            g_SDH_i32ErrCode = SDH_TIMEOUT_ERR;
            break;
        }
    }

    u32TimeOutCount = TIMEOUT_SDH;
    while(sdh->CTL & SDH_CTL_DIEN_Msk)
    {
        if(pSD->IsCardInsert == (uint32_t)FALSE)
        {
            return SDH_NO_SD_CARD;
        }
        if(--u32TimeOutCount == 0)
        {
            g_SDH_i32ErrCode = SDH_TIMEOUT_ERR;
            break;
        }
    }

    if(!(sdh->INTSTS & SDH_INTSTS_CRC7_Msk))       /* check CRC7 */
    {
        return SDH_CRC7_ERROR;
    }

    if(!(sdh->INTSTS & SDH_INTSTS_CRC16_Msk))      /* check CRC16 */
    {
        return SDH_CRC16_ERROR;
    }

    return Successful;
}

/* there are 8 bits for divider0, maximum is 256 */
#define SDH_CLK_DIV0_MAX     256UL

void SDH_Set_clock(SDH_T *sdh, uint32_t u32SDClockKhz)
{
    (void)sdh;
    if(!(__PC() & (1UL << 28)))
    {
        uint32_t u32Rate, u32Div1;
        static uint32_t u32SDClkSrc = 0UL;

        /* M2354 is only support SDH0 */
        u32SDClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDH0SEL_Msk);
        if(u32SDClkSrc == CLK_CLKSEL0_SDH0SEL_HXT)
        {
            _SDH_ReferenceClock = (CLK_GetHXTFreq() / 1000UL);
        }
        else if(u32SDClkSrc == CLK_CLKSEL0_SDH0SEL_HIRC)
        {
            _SDH_ReferenceClock = (__HIRC / 1000UL);
        }
        else if(u32SDClkSrc == CLK_CLKSEL0_SDH0SEL_PLL)
        {
            _SDH_ReferenceClock = (CLK_GetPLLClockFreq() / 1000UL);
        }
        else if(u32SDClkSrc == CLK_CLKSEL0_SDH0SEL_HCLK)
        {
            _SDH_ReferenceClock = (CLK_GetHCLKFreq() / 1000UL);
        }

        if(u32SDClockKhz >= 50000UL)
        {
            u32SDClockKhz = 50000UL;
        }
        u32Rate = _SDH_ReferenceClock / u32SDClockKhz;

        /* choose slower clock if system clock cannot divisible by wanted clock */
        if(_SDH_ReferenceClock % u32SDClockKhz != 0UL)
        {
            u32Rate++;
        }

        if(u32Rate >= SDH_CLK_DIV0_MAX)
        {
            u32Rate = SDH_CLK_DIV0_MAX;
        }

        /* --- calculate the second divider CLKDIV0[SDHOST_N] */
        if(u32Rate == 0UL)
        {
            u32Div1 = 0UL;
        }
        else
        {
            u32Div1 = ((u32Rate - 1UL) & 0xFFUL);
        }

        /* --- setup register */
        /* M2354 is only support SDH0 */
        CLK->CLKDIV0 &= ~CLK_CLKDIV0_SDH0DIV_Msk;
        CLK->CLKDIV0 |= (u32Div1 << CLK_CLKDIV0_SDH0DIV_Pos);
    }
}

uint32_t SDH_CardDetection(SDH_T *sdh)
{
    uint32_t i, u32Status = (uint32_t)TRUE;
    SDH_INFO_T *pSD;

    /* M2354 is only support SDH0 */
    pSD = &SD0;

    if(sdh->INTEN & SDH_INTEN_CDSRC_Msk)   /* Card detect pin from GPIO */
    {
        if(sdh->INTSTS & SDH_INTSTS_CDSTS_Msk)   /* Card remove */
        {
            pSD->IsCardInsert = (uint8_t)FALSE;
            u32Status = (uint32_t)FALSE;
        }
        else
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
    }
    else if(!(sdh->INTEN & SDH_INTEN_CDSRC_Msk))
    {
        sdh->CTL |= SDH_CTL_CLKKEEP_Msk;
        for(i = 0UL; i < 5000UL; i++) {}

        if(sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) /* Card insert */
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
        else
        {
            pSD->IsCardInsert = (uint8_t)FALSE;
            u32Status = (uint32_t)FALSE;
        }

        sdh->CTL &= ~SDH_CTL_CLKKEEP_Msk;
    }

    return u32Status;
}


/* Initial */
uint32_t SDH_Init(SDH_T *sdh)
{
    uint32_t volatile i, u32Status;
    uint32_t u32Resp;
    uint32_t au32CIDBuffer[4];
    uint32_t volatile u32CmdTimeOut;
    SDH_INFO_T *pSD;
    uint32_t u32TimeOutCount;

    g_SDH_i32ErrCode = 0;

    /* M2354 is only support SDH0 */
    pSD = &SD0;

    /* set the clock to 300KHz */
    SDH_Set_clock(sdh, 300UL);

    /* power ON 74 clock */
    sdh->CTL |= SDH_CTL_CLK74OEN_Msk;

    u32TimeOutCount = TIMEOUT_SDH;
    while(sdh->CTL & SDH_CTL_CLK74OEN_Msk)
    {
        if(pSD->IsCardInsert == (uint8_t)FALSE)
        {
            return SDH_NO_SD_CARD;
        }
        if(--u32TimeOutCount == 0)
        {
            g_SDH_i32ErrCode = SDH_TIMEOUT_ERR;
            break;
        }
    }

    SDH_SDCommand(sdh, 0UL, 0UL);        /* reset all cards */
    for(i = 0x1000UL; i > 0UL; i--) {}

    /* initial SDHC */
    _SDH_uR7_CMD = 1UL;
    u32CmdTimeOut = 0xFFFFFUL;

    i = SDH_SDCmdAndRsp(sdh, 8UL, 0x00000155UL, u32CmdTimeOut);
    if(i == Successful)
    {
        /* SD 2.0 */
        SDH_SDCmdAndRsp(sdh, 55UL, 0x00UL, u32CmdTimeOut);
        g_u8R3Flag = 1UL;
        SDH_SDCmdAndRsp(sdh, 41UL, 0x40ff8000UL, u32CmdTimeOut); /* 2.7v-3.6v */
        u32Resp = sdh->RESP0;

        u32TimeOutCount = TIMEOUT_SDH;
        while(!(u32Resp & 0x00800000UL))         /* check if card is ready */
        {
            SDH_SDCmdAndRsp(sdh, 55UL, 0x00UL, u32CmdTimeOut);
            g_u8R3Flag = 1UL;
            SDH_SDCmdAndRsp(sdh, 41UL, 0x40ff8000UL, u32CmdTimeOut); /* 3.0v-3.4v */
            u32Resp = sdh->RESP0;
            if(--u32TimeOutCount == 0)
            {
                g_SDH_i32ErrCode = SDH_TIMEOUT_ERR;
                break;
            }
        }
        if(u32Resp & 0x00400000UL)
        {
            pSD->CardType = SDH_TYPE_SD_HIGH;
        }
        else
        {
            pSD->CardType = SDH_TYPE_SD_LOW;
        }
    }
    else
    {
        /* SD 1.1 */
        SDH_SDCommand(sdh, 0UL, 0UL);        /* reset all cards */
        for(i = 0x100UL; i > 0UL; i--) {}

        i = SDH_SDCmdAndRsp(sdh, 55UL, 0x00UL, u32CmdTimeOut);
        if(i == 2UL)      /* MMC memory */
        {
            SDH_SDCommand(sdh, 0UL, 0UL);        /* reset */
            for(i = 0x100UL; i > 0UL; i--) {}

            g_u8R3Flag = 1UL;

            if(SDH_SDCmdAndRsp(sdh, 1UL, 0x40ff8000UL, u32CmdTimeOut) != 2UL)     /* eMMC memory */
            {
                u32Resp = sdh->RESP0;
                u32TimeOutCount = TIMEOUT_SDH;
                while(!(u32Resp & 0x00800000UL))         /* check if card is ready */
                {
                    g_u8R3Flag = 1UL;

                    SDH_SDCmdAndRsp(sdh, 1UL, 0x40ff8000UL, u32CmdTimeOut);      /* high voltage */
                    u32Resp = sdh->RESP0;

                    if(--u32TimeOutCount == 0)
                    {
                        g_SDH_i32ErrCode = SDH_TIMEOUT_ERR;
                        break;
                    }
                }

                if(u32Resp & 0x00400000UL)
                {
                    pSD->CardType = SDH_TYPE_EMMC;
                }
                else
                {
                    pSD->CardType = SDH_TYPE_MMC;
                }
            }
            else
            {
                pSD->CardType = SDH_TYPE_UNKNOWN;
                return SDH_ERR_DEVICE;
            }
        }
        else if(i == 0UL)      /* SD Memory */
        {
            g_u8R3Flag = 1UL;
            SDH_SDCmdAndRsp(sdh, 41UL, 0x00ff8000UL, u32CmdTimeOut); /* 3.0v-3.4v */
            u32Resp = sdh->RESP0;
            u32TimeOutCount = TIMEOUT_SDH;
            while(!(u32Resp & 0x00800000UL))         /* check if card is ready */
            {
                SDH_SDCmdAndRsp(sdh, 55UL, 0x00UL, u32CmdTimeOut);
                g_u8R3Flag = 1UL;
                SDH_SDCmdAndRsp(sdh, 41UL, 0x00ff8000UL, u32CmdTimeOut); /* 3.0v-3.4v */
                u32Resp = sdh->RESP0;
                if(--u32TimeOutCount == 0)
                {
                    g_SDH_i32ErrCode = SDH_TIMEOUT_ERR;
                    break;
                }
            }
            pSD->CardType = SDH_TYPE_SD_LOW;
        }
        else
        {
            pSD->CardType = SDH_TYPE_UNKNOWN;
            return SDH_INIT_ERROR;
        }
    }

    /* CMD2, CMD3 */
    if(pSD->CardType != SDH_TYPE_UNKNOWN)
    {
        SDH_SDCmdAndRsp2(sdh, 2UL, 0x00UL, au32CIDBuffer);
        if((pSD->CardType == SDH_TYPE_MMC) || (pSD->CardType == SDH_TYPE_EMMC))
        {
            if((u32Status = SDH_SDCmdAndRsp(sdh, 3UL, 0x10000UL, 0UL)) != Successful)         /* set RCA */
            {
                return u32Status;
            }
            pSD->RCA = 0x10000UL;
        }
        else
        {
            if((u32Status = SDH_SDCmdAndRsp(sdh, 3UL, 0x00UL, 0UL)) != Successful)        /* get RCA */
            {
                return u32Status;
            }
            else
            {
                pSD->RCA = (sdh->RESP0 << 8) & 0xffff0000UL;
            }
        }
    }

    return Successful;
}


